; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	)
(:init
	(at plane1 city5)
	(= (capacity plane1) 5815)
	(= (fuel plane1) 678)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 4)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 5)
	(at person1 city1)
	(at person2 city1)
	(at person3 city3)
	(at person4 city6)
	(at person5 city4)
	(at person6 city6)
	(at person7 city2)
	(at person8 city5)
	(at person9 city1)
	(at person10 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 807)
	(= (distance city0 city2) 728)
	(= (distance city0 city3) 606)
	(= (distance city0 city4) 560)
	(= (distance city0 city5) 521)
	(= (distance city0 city6) 976)
	(= (distance city1 city0) 807)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 872)
	(= (distance city1 city3) 654)
	(= (distance city1 city4) 925)
	(= (distance city1 city5) 934)
	(= (distance city1 city6) 726)
	(= (distance city2 city0) 728)
	(= (distance city2 city1) 872)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 938)
	(= (distance city2 city4) 914)
	(= (distance city2 city5) 823)
	(= (distance city2 city6) 507)
	(= (distance city3 city0) 606)
	(= (distance city3 city1) 654)
	(= (distance city3 city2) 938)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 676)
	(= (distance city3 city5) 695)
	(= (distance city3 city6) 591)
	(= (distance city4 city0) 560)
	(= (distance city4 city1) 925)
	(= (distance city4 city2) 914)
	(= (distance city4 city3) 676)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 996)
	(= (distance city4 city6) 677)
	(= (distance city5 city0) 521)
	(= (distance city5 city1) 934)
	(= (distance city5 city2) 823)
	(= (distance city5 city3) 695)
	(= (distance city5 city4) 996)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 846)
	(= (distance city6 city0) 976)
	(= (distance city6 city1) 726)
	(= (distance city6 city2) 507)
	(= (distance city6 city3) 591)
	(= (distance city6 city4) 677)
	(= (distance city6 city5) 846)
	(= (distance city6 city6) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city3)
	(at person1 city4)
	(at person2 city4)
	(at person3 city3)
	(at person4 city2)
	(at person5 city2)
	(at person6 city3)
	(at person7 city1)
	(at person8 city2)
	(at person9 city1)
	(at person10 city6)
	))

(:metric minimize (+ (* 1 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (refuel plane1 city5)
   changed: (fuel plane1) from 678 to 5815
   goals met: 2 of 11
2. (board person8 plane1 city5)
   deleted: (at person8 city5)
   added: (in person8 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 11
3. (fly plane1 city5 city2)
   deleted: (at plane1 city5)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 0 to 1646, (fuel plane1) from 5815 to 4169
   goals met: 2 of 11
4. (debark person8 plane1 city2)
   deleted: (in person8 plane1)
   added: (at person8 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 11
5. (board person7 plane1 city2)
   deleted: (at person7 city2)
   added: (in person7 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 11
6. (board person10 plane1 city2)
   deleted: (at person10 city2)
   added: (in person10 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 11
7. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 1646 to 3390, (fuel plane1) from 4169 to 2425
   goals met: 3 of 11
8. (debark person7 plane1 city1)
   deleted: (in person7 plane1)
   added: (at person7 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 4 of 11
9. (board person1 plane1 city1)
   deleted: (at person1 city1)
   added: (in person1 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 4 of 11
10. (board person2 plane1 city1)
   deleted: (at person2 city1)
   added: (in person2 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 4 of 11
11. (fly plane1 city1 city3)
   deleted: (at plane1 city1)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 3390 to 4698, (fuel plane1) from 2425 to 1117
   goals met: 5 of 11
12. (refuel plane1 city3)
   changed: (fuel plane1) from 1117 to 5815
   goals met: 5 of 11
13. (fly plane1 city3 city4)
   deleted: (at plane1 city3)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 4698 to 6050, (fuel plane1) from 5815 to 4463
   goals met: 4 of 11
14. (debark person1 plane1 city4)
   deleted: (in person1 plane1)
   added: (at person1 city4)
   changed: (onboard plane1) from 3 to 2
   goals met: 5 of 11
15. (debark person2 plane1 city4)
   deleted: (in person2 plane1)
   added: (at person2 city4)
   changed: (onboard plane1) from 2 to 1
   goals met: 6 of 11
16. (board person5 plane1 city4)
   deleted: (at person5 city4)
   added: (in person5 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 6 of 11
17. (fly plane1 city4 city2)
   deleted: (at plane1 city4)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 6050 to 7878, (fuel plane1) from 4463 to 2635
   goals met: 6 of 11
18. (debark person5 plane1 city2)
   deleted: (in person5 plane1)
   added: (at person5 city2)
   changed: (onboard plane1) from 2 to 1
   goals met: 7 of 11
19. (fly plane1 city2 city6)
   deleted: (at plane1 city2)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 7878 to 8892, (fuel plane1) from 2635 to 1621
   goals met: 7 of 11
20. (debark person10 plane1 city6)
   deleted: (in person10 plane1)
   added: (at person10 city6)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 11
21. (board person4 plane1 city6)
   deleted: (at person4 city6)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 8 of 11
22. (board person6 plane1 city6)
   deleted: (at person6 city6)
   added: (in person6 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 8 of 11
23. (fly plane1 city6 city3)
   deleted: (at plane1 city6)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 8892 to 10074, (fuel plane1) from 1621 to 439
   goals met: 9 of 11
24. (debark person6 plane1 city3)
   deleted: (in person6 plane1)
   added: (at person6 city3)
   changed: (onboard plane1) from 2 to 1
   goals met: 10 of 11
25. (refuel plane1 city3)
   changed: (fuel plane1) from 439 to 5815
   goals met: 10 of 11
26. (fly plane1 city3 city2)
   deleted: (at plane1 city3)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 10074 to 11950, (fuel plane1) from 5815 to 3939
   goals met: 9 of 11
27. (debark person4 plane1 city2)
   deleted: (in person4 plane1)
   added: (at person4 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 10 of 11
28. (fly plane1 city2 city3)
   deleted: (at plane1 city2)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 11950 to 13826, (fuel plane1) from 3939 to 2063
   goals met: 11 of 11
